# Написать функцию перевода десятичного числа в двоичное и обратно, без
# использования функции int
str: int = "8"
str.decode()
print(str)
