# Вывести первые N чисел кратные M и больше K

numbers = [110, 152, 35, 8, 88, 515, 68, 299, 5, 86, 200, 44, 972, 52]

N = int(input("Введите количество чисел, которое надо вывести: "))
M = int(input("Введите число, проверки на кратность: "))
K = int(input("Введите число, проверка на больше: "))

print(N, M, K)

numbers_1: int = list()

for numn in numbers:
    for int in numn:
        numn = numbers()
        print(numn)

    print(numn)


# if 55 > K:
#     numbers_1 = numbers

# new_table = True if numbers % M else False
# for i in range(0, N):
# print (i)
print(numbers)
print(numbers_1)

